pmorgantech/WaveX/firmware/esp32/components/ui/components/file_browser.cpp
#include "comm/value_queue.h"

#include <new>
/**
 * @file file_browser.cpp
 * @brief File Browser Component Implementation
 */

#include <stdint.h>
#include <stdlib.h>
#include <string.h>

#include "../styles/ui_theme.h"
#include "comm/i_comm_interface.h"
#include "esp_log.h"
#include "esp_timer.h"
#include "file_browser.h"
#include "freertos/FreeRTOS.h"
#include "freertos/task.h"
#include "inter_mcu.h"
#include "lvgl.h"
#include "spi_protocol/protocol.h"

#include <cstdio>
// Mark UI content changes so the main UI task triggers a refresh
#ifndef WAVEX_TEST_BUILD
#include "ui/ui_api.h"
#else
#include "../../../tests/mocks/esp32_mocks.h"
#endif

using namespace WaveX::Protocol;

// LVGL includes for thread safety
#include "esp_lvgl_port.h"

// NOTE: LVGL locks are handled by UI task loop - all UI updates use deferred update pattern

static const char* TAG = "FILE_BROWSER";

// ---------------------------------------------------------------------------
// Row rendering (design 1b)
// ---------------------------------------------------------------------------
// One place, called from all three row-building sites. They had drifted:
// different fonts, different selection colours, and the duration was not shown
// at all. A row is 54px, directories read dim, and the duration sits right.

#define FB_ROW_H 54
#define FB_COL_LIST_BG lv_color_hex(0x0E0E0E)
#define FB_COL_SEL_BG lv_color_hex(0x14261A)
#define FB_COL_SEL_RING lv_color_hex(0x4CAF50)
#define FB_COL_BORDER lv_color_hex(0x222222)
#define FB_COL_DIM lv_color_hex(0x8FA0AA)
#define FB_COL_META lv_color_hex(0x7F8A90)

// Rows that are not file entries (the spinner, "No files found") carry this in
// their user_data so a tap on one is ignored rather than resolving to entry 0,
// which is what an unset user_data would look like.
static constexpr uint32_t FB_ROW_NOT_AN_ENTRY = UINT32_MAX;

// A spinner row pinned at the end of the list while a page is in flight
// (design 1b). Deliberately not the modal busy overlay: pagination must not
// block the list, and the rows already fetched stay usable while it loads.
static void fb_show_loading_row(wavex_file_browser_t* browser, bool show) {
    if (!browser || !browser->list) {
        return;
    }
    if (!show) {
        if (browser->loading_row && lv_obj_is_valid(browser->loading_row)) {
            lv_obj_del(browser->loading_row);
        }
        browser->loading_row = nullptr;
        return;
    }
    if (browser->loading_row && lv_obj_is_valid(browser->loading_row)) {
        lv_obj_move_foreground(browser->loading_row);
        return;  // already up
    }
    lv_obj_t* row = lv_obj_create(browser->list);
    lv_obj_set_user_data(row, (void*)(uintptr_t)FB_ROW_NOT_AN_ENTRY);
    lv_obj_set_size(row, lv_pct(100), FB_ROW_H);
    lv_obj_set_style_bg_color(row, FB_COL_LIST_BG, LV_PART_MAIN);
    lv_obj_set_style_border_width(row, 0, LV_PART_MAIN);
    lv_obj_remove_flag(row, LV_OBJ_FLAG_SCROLLABLE);

    lv_obj_t* sp = lv_spinner_create(row);
    lv_obj_set_size(sp, 24, 24);
    lv_obj_align(sp, LV_ALIGN_LEFT_MID, 0, 0);
    lv_obj_set_style_arc_color(sp, FB_COL_SEL_RING, LV_PART_INDICATOR);
    lv_obj_set_style_arc_width(sp, 3, LV_PART_MAIN);
    lv_obj_set_style_arc_width(sp, 3, LV_PART_INDICATOR);

    lv_obj_t* txt = lv_label_create(row);
    // "Loading...", not "Loading more...": the same row now also covers the
    // gap before the FIRST page of a fresh navigation arrives.
    lv_label_set_text(txt, "Loading...");
    lv_obj_set_style_text_font(txt, UI_FONT_SMALL, LV_PART_MAIN);
    lv_obj_set_style_text_color(txt, FB_COL_DIM, LV_PART_MAIN);
    lv_obj_align(txt, LV_ALIGN_LEFT_MID, 36, 0);

    browser->loading_row = row;
}

static void fb_format_duration(char* out, size_t n, uint32_t ms) {
    if (ms == 0) {
        out[0] = '\0';
        return;
    }
    const uint32_t total_s = ms / 1000;
    snprintf(out, n, "%lu:%02lu", (unsigned long)(total_s / 60), (unsigned long)(total_s % 60));
}

// Applies the row chrome and adds the right-aligned duration. `entry` may be
// null for placeholder rows ("No files found...").
static void fb_style_row(lv_obj_t* btn, const wavex_file_entry_t* entry, bool selected) {
    if (!btn) {
        return;
    }
    lv_obj_set_height(btn, FB_ROW_H);
    lv_obj_set_style_radius(btn, 4, LV_PART_MAIN);
    lv_obj_set_style_pad_left(btn, 14, LV_PART_MAIN);
    lv_obj_set_style_pad_right(btn, 16, LV_PART_MAIN);
    lv_obj_set_style_bg_color(btn, selected ? FB_COL_SEL_BG : FB_COL_LIST_BG, LV_PART_MAIN);
    lv_obj_set_style_border_color(btn, selected ? FB_COL_SEL_RING : FB_COL_BORDER, LV_PART_MAIN);
    lv_obj_set_style_border_width(btn, selected ? 2 : 1, LV_PART_MAIN);

    lv_obj_t* name_label = lv_obj_get_child(btn, 0);
    if (name_label) {
        lv_obj_set_style_text_font(name_label, UI_FONT_BODY, LV_PART_MAIN);
        // Directories read dim: they are navigation, not material.
        const bool dir = entry && entry->is_directory;
        lv_obj_set_style_text_color(name_label, dir ? FB_COL_DIM : UI_COLOR_TEXT, LV_PART_MAIN);
    }

    if (!entry || entry->is_directory || entry->duration_ms == 0) {
        return;
    }
    char dur[16];
    fb_format_duration(dur, sizeof(dur), entry->duration_ms);
    if (dur[0] == '\0') {
        return;
    }
    // One duration label per row, reused rather than appended - this styler
    // runs again on every selection change.
    lv_obj_t* meta = (lv_obj_get_child_cnt(btn) > 1) ? lv_obj_get_child(btn, 1) : nullptr;
    if (!meta) {
        meta = lv_label_create(btn);
        lv_obj_set_style_text_font(meta, UI_FONT_SMALL, LV_PART_MAIN);
        lv_obj_set_style_text_color(meta, FB_COL_META, LV_PART_MAIN);
    }
    lv_label_set_text(meta, dur);
    lv_obj_align(meta, LV_ALIGN_RIGHT_MID, 0, 0);
}

struct BrowserInbox {
    struct Reply {
        size_t length = 0;
        uint8_t data[2048] = {};
    };
    WaveX::Comm::ValueQueue<Reply, 4> replies;
    WaveX::Comm::ValueQueue<bool, 4> storage;
};

// Browser instances are passed via user_data in callbacks - no global needed

static void file_list_event_cb(lv_event_t* e);
static bool refresh_file_list(wavex_file_browser_t* browser);
static bool parse_browse_response_with_pagination(const uint8_t* data,
                                                  size_t length,
                                                  wavex_file_entry_t* entries,
                                                  uint32_t* count,
                                                  uint32_t* total_files,
                                                  uint8_t* current_page_entries,
                                                  const char* current_path);
static bool send_browse_request(wavex_file_browser_t* browser,
                                uint8_t start_index,
                                bool retry = false);
static void update_visual_selection(wavex_file_browser_t* browser);
static void browse_resp_callback(const uint8_t* data, size_t length, void* user_data);
static void storage_status_callback(bool mounted, void* user_data);
static void apply_browse_response(const uint8_t* data, size_t length, void* user_data);
static void apply_storage_status(bool mounted, void* user_data);
static void update_file_browser_ui(wavex_file_browser_t* browser);

// UI dirty flags. RX callbacks publish only to BrowserInbox.
static inline void browser_set_ui_update(wavex_file_browser_t* browser) {
    __atomic_store_n(&browser->ui_update_pending, true, __ATOMIC_RELEASE);
}
static inline void browser_clear_ui_update(wavex_file_browser_t* browser) {
    __atomic_store_n(&browser->ui_update_pending, false, __ATOMIC_RELAXED);
}
static inline bool browser_ui_update_pending(const wavex_file_browser_t* browser) {
    return __atomic_load_n(&browser->ui_update_pending, __ATOMIC_ACQUIRE);
}

// Cheap sibling of the flag above for selection moves that leave the viewport
// where it is: the UI task only restyles the highlight instead of destroying
// and recreating every visible LVGL button. Same release/acquire discipline -
// selection can move from the UI task (encoder) and the LVGL task (softkeys).
static inline void browser_set_selection_update(wavex_file_browser_t* browser) {
    __atomic_store_n(&browser->selection_update_pending, true, __ATOMIC_RELEASE);
}
static inline void browser_clear_selection_update(wavex_file_browser_t* browser) {
    __atomic_store_n(&browser->selection_update_pending, false, __ATOMIC_RELAXED);
}
static inline bool browser_selection_update_pending(const wavex_file_browser_t* browser) {
    return __atomic_load_n(&browser->selection_update_pending, __ATOMIC_ACQUIRE);
}

// Pagination state is owned by the UI domain.
static inline void browser_set_pagination_in_progress(wavex_file_browser_t* browser) {
    __atomic_store_n(&browser->pagination_in_progress, true, __ATOMIC_RELEASE);
}
static inline void browser_clear_pagination_in_progress(wavex_file_browser_t* browser) {
    __atomic_store_n(&browser->pagination_in_progress, false, __ATOMIC_RELAXED);
}
static inline bool browser_pagination_in_progress(const wavex_file_browser_t* browser) {
    return __atomic_load_n(&browser->pagination_in_progress, __ATOMIC_ACQUIRE);
}

