pmorgantech/WaveX/firmware/esp32/components/ui/components/file_browser.cpp
wavex_file_browser_t* wavex_file_browser_create(lv_obj_t* parent,
                                                const wavex_file_browser_config_t* config) {
    if (!parent || !config) {
        ESP_LOGE(TAG, "Invalid parameters");
        return NULL;
    }

    wavex_file_browser_t* browser = (wavex_file_browser_t*)malloc(sizeof(wavex_file_browser_t));
    if (!browser) {
        ESP_LOGE(TAG, "Failed to allocate file browser structure");
        return NULL;
    }

    memset(browser, 0, sizeof(wavex_file_browser_t));
    browser->inbox = new (std::nothrow) BrowserInbox;
    if (!browser->inbox) {
        free(browser);
        return nullptr;
    }
    browser->config = *config;
    browser->selected_index = 0;
    browser->storage_mounted = true;
    browser->first_visible_index = 0;
    browser->visible_count =
        8;  // Approximately 8 entries visible on screen (adjust based on screen size)

    browser->request_id = 0;
    browser->browse_failed = false;
    browser->request_attempts = 0;
    browser->total_files = 0;
    browser->current_page = 0;
    browser->entries_per_page =
        20;  // Daisy now sends 20 entries per page with flexible packet system
    browser_clear_pagination_in_progress(browser);
    browser->loaded_entries = 0;

    strncpy(browser->current_path,
            config->root_path ? config->root_path : "/",
            sizeof(browser->current_path) - 1);
    browser->current_path[sizeof(browser->current_path) - 1] = '\0';

    browser->entries =
        (wavex_file_entry_t*)malloc(config->max_entries * sizeof(wavex_file_entry_t));
    if (!browser->entries) {
        ESP_LOGE(TAG, "Failed to allocate entries array");
        delete browser->inbox;
        free(browser);
        return NULL;
    }

    // Create main container (page creation callbacks already have LVGL context)
    browser->container = lv_obj_create(parent);
    lv_obj_set_size(browser->container, lv_pct(100), lv_pct(100));
    lv_obj_set_style_bg_color(browser->container, UI_COLOR_CONTENT, LV_PART_MAIN);
    lv_obj_set_style_border_width(browser->container, 0, LV_PART_MAIN);
    lv_obj_set_style_pad_all(browser->container, 0, LV_PART_MAIN);
    lv_obj_align(browser->container, LV_ALIGN_TOP_LEFT, 0, 0);

    browser->path_label = lv_label_create(browser->container);
    lv_label_set_text(browser->path_label, browser->current_path);
    ui_theme_apply_label_style(browser->path_label, false);
    lv_obj_align(browser->path_label, LV_ALIGN_TOP_LEFT, UI_PADDING_MEDIUM, UI_PADDING_MEDIUM);

    browser->list = lv_list_create(browser->container);
    // Note: Do not perform arithmetic with lv_pct(); set full height and offset below path label
    lv_obj_set_size(browser->list, lv_pct(100), lv_pct(100));
    lv_obj_align(
        browser->list, LV_ALIGN_TOP_LEFT, 0, 40);  // visually below the 40px-tall path label
    lv_obj_set_style_bg_color(browser->list, UI_COLOR_CONTENT, LV_PART_MAIN);
    lv_obj_set_style_border_width(browser->list, 0, LV_PART_MAIN);
    lv_obj_set_style_pad_all(browser->list, UI_PADDING_SMALL, LV_PART_MAIN);

    // The row handler is attached per row in update_file_browser_ui(), on
    // LV_EVENT_SHORT_CLICKED - see the note there. Nothing is attached to the
    // list itself: a list-level LV_EVENT_CLICKED is exactly what did not work.

    if (config->comm_interface) {
        config->comm_interface->setBrowseResponseListener(browse_resp_callback, browser);
        // Re-list automatically when a card appears. The backend owns the card
        // slot; without this the browser only refreshes when the user leaves
        // the page and comes back.
        config->comm_interface->setStorageStatusListener(storage_status_callback, browser);
    } else {
        ESP_LOGE(TAG, "No comm interface provided to file browser");
        free(browser->entries);
        delete browser->inbox;
        free(browser);
        return NULL;
    }

    ESP_LOGI(TAG, "Calling refresh_file_list for path: %s", browser->current_path);
    if (!refresh_file_list(browser)) {
        ESP_LOGE(TAG, "Failed to refresh file list");
    }

    for (uint32_t i = 0; i < browser->entry_count; i++) {
        ESP_LOGI(TAG,
                 "Entry %d: %s (%s) - %s",
                 i,
                 browser->entries[i].name,
                 browser->entries[i].is_directory ? "DIR" : "FILE",
                 browser->entries[i].path);
    }
    return browser;
}

void wavex_file_browser_destroy(wavex_file_browser_t* browser) {
    if (!browser)
        return;

    // Deregister BEFORE freeing anything. Both listeners were registered with
    // `browser` as user_data and are invoked from the UART task, so without
    // this a browse response or an SD-eject notification arriving after the
    // page was popped would write through freed memory - reachable in practice
    // by pressing Back while a directory listing is still paginating.
    //
    // This is also why the clear has to be the blocking kind: ListenerSlot
    // holds its mutex across the invocation, so by the time these return, no
    // callback is still running and the free below is safe.
    if (browser->config.comm_interface) {
        browser->config.comm_interface->setBrowseResponseListener(nullptr, nullptr);
        browser->config.comm_interface->setStorageStatusListener(nullptr, nullptr);
    }

    if (browser->entries) {
        free(browser->entries);
    }

    if (browser->container) {
        // Page destruction should be called from LVGL context
        lv_obj_del(browser->container);
    }

    delete browser->inbox;
    free(browser);
    ESP_LOGI(TAG, "File browser destroyed");
}

bool wavex_file_browser_navigate_to(wavex_file_browser_t* browser, const char* path) {
    if (!browser || !path)
        return false;

    strncpy(browser->current_path, path, sizeof(browser->current_path) - 1);
    browser->current_path[sizeof(browser->current_path) - 1] = '\0';

    // Mark path update as pending (navigation may be called from non-LVGL context)
    browser_set_ui_update(browser);
    wavex_ui_mark_content_changed();

    browser->first_visible_index = 0;
    browser->selected_index = 0;

    bool success = refresh_file_list(browser);

    if (success && browser->dir_changed_cb) {
        browser->dir_changed_cb(browser->current_path, browser->user_data);
    }

    return success;
}

bool wavex_file_browser_navigate_up(wavex_file_browser_t* browser) {
    if (!browser)
        return false;

