pmorgantech/WaveX/firmware/esp32/components/ui/components/file_browser.cpp
    return true;
}

void wavex_file_browser_set_file_selected_callback(wavex_file_browser_t* browser,
                                                   wavex_file_selected_cb_t callback,
                                                   void* user_data) {
    if (!browser)
        return;

    browser->file_selected_cb = callback;
    browser->user_data = user_data;
}

void wavex_file_browser_set_file_selected_index_callback(wavex_file_browser_t* browser,
                                                         wavex_file_selected_index_cb_t callback,
                                                         void* user_data) {
    if (!browser)
        return;

    browser->file_selected_index_cb = callback;
    browser->user_data = user_data;
}

void wavex_file_browser_set_directory_changed_callback(wavex_file_browser_t* browser,
                                                       wavex_directory_changed_cb_t callback,
                                                       void* user_data) {
    if (!browser)
        return;

    browser->dir_changed_cb = callback;
    browser->user_data = user_data;
}

const char* wavex_file_browser_get_current_path(wavex_file_browser_t* browser) {
    if (!browser)
        return NULL;

    return browser->current_path;
}

uint32_t wavex_file_browser_get_entry_count(wavex_file_browser_t* browser) {
    if (!browser)
        return 0;

    return browser->entry_count;
}

const wavex_file_entry_t* wavex_file_browser_get_entry(wavex_file_browser_t* browser,
                                                       uint32_t index) {
    if (!browser || index >= browser->entry_count)
        return NULL;

    return &browser->entries[index];
}

static void file_list_event_cb(lv_event_t* e) {
    lv_event_code_t code = lv_event_get_code(e);
    wavex_file_browser_t* browser = (wavex_file_browser_t*)lv_event_get_user_data(e);

    // Registered per row for SHORT_CLICKED; the CLICKED arm is kept so a
    // programmatic click or a non-scrollable future container still works.
    if (code == LV_EVENT_SHORT_CLICKED || code == LV_EVENT_CLICKED) {
        // The handler is attached to the row, so current_target is the row.
        // Use it rather than get_target: if the touch lands on the row's label
        // rather than its background, get_target reports the label, whose
        // user_data is unset and would decode as entry 0.
        lv_obj_t* btn = (lv_obj_t*)lv_event_get_current_target(e);

        // The entry index was stored on the button when the row was built.
        // Deriving it from the child position instead - which is what this did
        // - is only correct while the list starts at entry 0: rows exist only
        // for the visible window starting at first_visible_index, and the
        // pagination spinner is a child of the same list, so once the user had
        // scrolled, a tap selected the wrong file (or entered the wrong
        // directory).
        const uint32_t entry_index = (uint32_t)(uintptr_t)lv_obj_get_user_data(btn);
        if (entry_index == FB_ROW_NOT_AN_ENTRY) {
            return;  // spinner or placeholder row
        }

        if (entry_index < browser->entry_count) {
            const wavex_file_entry_t* entry = &browser->entries[entry_index];
            if (strcmp(entry->name, "..") == 0) {
                ESP_LOGI(TAG, "Parent directory entry clicked");
                wavex_file_browser_navigate_up(browser);
                return;
            }
        }

        if (entry_index < browser->entry_count) {
            wavex_file_browser_set_selection(browser, entry_index);

            if (browser->entries[entry_index].is_directory) {
                char new_path[256];
                // Avoid double slashes when constructing directory path
                if (strcmp(browser->current_path, "/") == 0) {
                    snprintf(new_path, sizeof(new_path), "/%s", browser->entries[entry_index].name);
                } else {
                    snprintf(new_path,
                             sizeof(new_path),
                             "%s/%s",
                             browser->current_path,
                             browser->entries[entry_index].name);
                }
                ESP_LOGD(TAG,
                         "Directory navigation: current='%s', name='%s' -> new_path='%s'",
                         browser->current_path,
                         browser->entries[entry_index].name,
                         new_path);
                wavex_file_browser_navigate_to(browser, new_path);
            } else {
                ESP_LOGI(TAG,
                         "File selected: %s, index=%d",
                         browser->entries[entry_index].name,
                         entry_index);

                if (browser->file_selected_index_cb) {
                    browser->file_selected_index_cb(
                        entry_index, &browser->entries[entry_index], browser->user_data);
                } else {
                    ESP_LOGW(TAG, "No callback set for file selection");
                }
            }
        }
    }
}

// Requests directory contents from Daisy; the response arrives asynchronously
// via browse_resp_callback.
static bool refresh_file_list(wavex_file_browser_t* browser) {
    if (!browser)
        return false;

    ESP_LOGI(TAG, "refresh_file_list called for path: %s", browser->current_path);

    browser->request_id = 0;
    browser->browse_failed = false;
    browser->request_attempts = 0;
    browser->total_files = 0;
    browser->current_page = 0;
    browser_set_pagination_in_progress(browser);
    browser->loaded_entries = 0;
    browser->entry_count = 0;

    // Mark UI update as pending (will clear list when processed in UI task)
    browser_set_ui_update(browser);
    wavex_ui_mark_content_changed();

    if (!send_browse_request(browser, 0)) {
        ESP_LOGE(TAG, "Failed to send browse request");
        browser_clear_pagination_in_progress(browser);
        browser->entry_count = 0;
        browser_set_ui_update(browser);
        wavex_ui_mark_content_changed();
        return false;
    } else {
        ESP_LOGI(TAG, "Sent browse request for page 0, waiting for response...");
        return true;
    }
}

static bool parse_browse_response_with_pagination(const uint8_t* data,
                                                  size_t length,
                                                  wavex_file_entry_t* entries,
                                                  uint32_t* count,
                                                  uint32_t* total_files,
                                                  uint8_t* current_page_entries,
                                                  const char* current_path) {
    if (!data || length < sizeof(BrowseRespHeader)) {
        ESP_LOGE(TAG,
                 "Browse response payload too short: %d bytes (need at least %d)",
                 (int)length,
                 (int)sizeof(BrowseRespHeader));
        *count = 0;
        *total_files = 0;
        *current_page_entries = 0;
        return false;
    }

    ESP_LOGD(TAG, "Parsing browse response payload: %d bytes", (int)length);

