pmorgantech/WaveX/firmware/esp32/components/ui/components/file_browser.cpp
static void browse_resp_callback(const uint8_t* data, size_t length, void* user_data) {
    auto* browser = static_cast<wavex_file_browser_t*>(user_data);
    if (!browser || !data || !length || length > sizeof(BrowserInbox::Reply::data))
        return;
    BrowserInbox::Reply reply;
    reply.length = length;
    memcpy(reply.data, data, length);
    browser->inbox->replies.Push(reply);
    wavex_ui_mark_content_changed();
}

static void apply_browse_response(const uint8_t* data, size_t length, void* user_data) {
    wavex_file_browser_t* browser = (wavex_file_browser_t*)user_data;
    if (!browser || !data || length == 0) {
        ESP_LOGE(TAG, "Invalid browse response callback parameters");
        return;
    }

    if (!IsValidBrowsePageResponse(data, length))
        return;
    BrowsePageHeader page;
    memcpy(&page, data, sizeof(page));
    if (!browser_pagination_in_progress(browser) || !browser->request_id ||
        page.request_id != browser->request_id ||
        page.start_index != browser->current_page * browser->entries_per_page ||
        page.filter != browser->config.filter)
        return;
    browser->request_id = 0;  // duplicates cannot append a second copy
    data += sizeof(page);
    length -= sizeof(page);

    ESP_LOGD(TAG, "Received browse response: %d bytes", (int)length);

    // Allocate on heap instead of stack to prevent stack overflow in uart_link task:
    // each entry is ~152 bytes, so 20 entries = ~3040 bytes - too large for task stack.
    wavex_file_entry_t* temp_entries = (wavex_file_entry_t*)malloc(20 * sizeof(wavex_file_entry_t));
    if (!temp_entries) {
        ESP_LOGE(TAG, "Failed to allocate memory for browse response parsing");
        fail_browse(browser);
        return;
    }

    uint32_t temp_count = 20;
    uint32_t total_files = 0;
    uint8_t current_page_entries = 0;

    bool parse_success = parse_browse_response_with_pagination(data,
                                                               length,
                                                               temp_entries,
                                                               &temp_count,
                                                               &total_files,
                                                               &current_page_entries,
                                                               browser->current_path);

    if (!parse_success) {
        free(temp_entries);
        ESP_LOGE(TAG, "Failed to parse browse response");
        fail_browse(browser);
        wavex_ui_mark_content_changed();
        return;
    }

    // An empty listing is authoritative, and it can arrive UNSOLICITED: the
    // Daisy sends one when the card is ejected or becomes unreadable. The
    // accumulate path below cannot express it - loaded_entries is only reset
    // by refresh_file_list(), so an unsolicited response would re-adopt the
    // stale count and leave the old files on screen, and if current_page were
    // non-zero it would not even mark a UI update. Handle it directly.
    if (total_files == 0 && current_page_entries == 0) {
        free(temp_entries);
        ESP_LOGD(TAG, "Empty browse response - clearing file list");
        browser->request_id = 0;
        browser->total_files = 0;
        browser->loaded_entries = 0;
        browser->entry_count = 0;
        browser->current_page = 0;
        browser->first_visible_index = 0;
        browser->selected_index = 0;
        browser_clear_pagination_in_progress(browser);
        browser_set_ui_update(browser);
        wavex_ui_mark_content_changed();
        return;
    }

    if (browser->current_page == 0) {
        browser->total_files = total_files;
        ESP_LOGD(TAG, "Total files in directory: %d", total_files);
    }

    // Sort ".." to the top if present (only on first page, and only if not at root).
    uint32_t start_index = browser->loaded_entries;
    uint32_t parent_dir_index = 0xFFFFFFFF;

    // First pass: find ".." entry position if on first page and not at root
    if (browser->current_page == 0 && strcmp(browser->current_path, "/") != 0) {
        for (uint32_t i = 0; i < current_page_entries; i++) {
            if (strcmp(temp_entries[i].name, "..") == 0) {
                parent_dir_index = i;
                break;
            }
        }
    }

    // Second pass: add entries, putting ".." first if found on first page
    uint32_t write_index = start_index;

    if (parent_dir_index != 0xFFFFFFFF && browser->current_page == 0 &&
        strcmp(browser->current_path, "/") != 0 && write_index < browser->config.max_entries) {
        browser->entries[write_index] = temp_entries[parent_dir_index];
        browser->loaded_entries++;
        write_index++;
    }

    for (uint32_t i = 0; i < current_page_entries && write_index < browser->config.max_entries;
         i++) {
        if (parent_dir_index != 0xFFFFFFFF && i == parent_dir_index) {
            continue;  // Skip ".." if already added at the top
        }
        browser->entries[write_index] = temp_entries[i];
        browser->loaded_entries++;
        write_index++;
    }

    ESP_LOGI(TAG,
             "Loaded page %d: %d entries, total loaded: %d/%d",
             browser->current_page,
             current_page_entries,
             browser->loaded_entries,
             browser->total_files);

    free(temp_entries);

    bool has_more_pages = (browser->loaded_entries < browser->total_files) &&
                          (browser->loaded_entries < browser->config.max_entries);

    // Update UI immediately after the first page loads rather than waiting for
    // pagination to finish, so the list is not blank while later pages stream in.
    if (browser->current_page == 0) {
        browser->entry_count = browser->loaded_entries;
        browser->first_visible_index = 0;

        // Default to first entry, or ".." if it was sorted there above.
        if (browser->selected_index >= browser->entry_count) {
            browser->selected_index = 0;
        }

