pmorgantech/WaveX/firmware/esp32/components/ui/components/file_browser.cpp
        ESP_LOGI(TAG, "First page loaded: marking %d entries for UI update", browser->entry_count);

        // Rebuild after applying this complete page in the UI domain.
        browser_set_ui_update(browser);
        wavex_ui_mark_content_changed();

        if (browser->dir_changed_cb) {
            browser->dir_changed_cb(browser->current_path, browser->user_data);
        }
    }

    if (has_more_pages) {
        browser->current_page++;
        const uint32_t next_start =
            static_cast<uint32_t>(browser->current_page) * browser->entries_per_page;

        // The wire field is uint8_t, so pagination cannot address past entry
        // 255. Stop rather than truncate: wrapping would silently re-request
        // an earlier page and loop over it forever. Keep this guard even when
        // a caller configures a larger capacity than the supported listing.
        if (next_start > UINT8_MAX) {
            ESP_LOGW(TAG,
                     "Listing exceeds the %d entries the browse protocol can address; "
                     "showing the first %lu",
                     UINT8_MAX,
                     (unsigned long)browser->loaded_entries);
            browser_clear_pagination_in_progress(browser);
            browser->entry_count = browser->loaded_entries;
            browser_set_ui_update(browser);
            wavex_ui_mark_content_changed();
            return;
        }
        const uint8_t next_start_index = static_cast<uint8_t>(next_start);

        ESP_LOGD(TAG,
                 "Requesting next page: current_page=%d, entries_per_page=%d, start_index=%d",
                 browser->current_page,
                 browser->entries_per_page,
                 next_start_index);
        if (!send_browse_request(browser, next_start_index)) {
            ESP_LOGE(TAG, "Failed to request next page");
            browser_clear_pagination_in_progress(browser);
        }
        return;  // more pages requested; this function runs again when they arrive
    } else {
        browser_clear_pagination_in_progress(browser);
        browser->entry_count = browser->loaded_entries;

        if (browser->selected_index >= browser->entry_count) {
            browser->selected_index = 0;
        }

        ESP_LOGI(TAG, "Pagination complete: loaded %d entries", browser->entry_count);

        // The first-page branch above already applied these for page 0.
        if (browser->current_page > 0) {
            browser_set_ui_update(browser);
            wavex_ui_mark_content_changed();
        }

        // Appending the final page is not directory navigation. Re-notifying
        // UISampleBrowser here reset its selected file to ".." after a user
        // had already selected a first-page sample. The UI rebuild above
        // preserves selection and updates the listing without that reset.
    }
}

// Thread-safe function to process pending UI updates (called from UI task with LVGL lock)
void wavex_file_browser_process_pending_updates(wavex_file_browser_t* browser) {
    if (!browser) {
        ESP_LOGE(TAG, "process_pending_updates: browser is NULL!");
        return;
    }

    if (browser->inbox) {
        const bool lost =
            browser->inbox->replies.TakeOverflow() | browser->inbox->storage.TakeOverflow();
        if (lost) {
            browser->inbox->replies.Clear();
            browser->inbox->storage.Clear();
            fail_browse(browser);
            ESP_LOGE(TAG, "Browser response queue overflow; refresh required");
        } else {
            bool mounted;
            for (unsigned i = 0; i < 4 && browser->inbox->storage.Pop(mounted); ++i)
                apply_storage_status(mounted, browser);
            BrowserInbox::Reply reply;
            for (unsigned i = 0; i < 4 && browser->inbox->replies.Pop(reply); ++i)
                apply_browse_response(reply.data, reply.length, browser);
        }
    }

    // One page at a time, at most three attempts. Unsigned elapsed time also
    // works when the millisecond counter wraps. Every attempt has a new ID.
    const uint32_t now = static_cast<uint32_t>(esp_timer_get_time() / 1000);
    if (browser_pagination_in_progress(browser) && now - browser->request_started_ms >= 1500u) {
        if (browser->request_attempts >= 3) {
            fail_browse(browser);
        } else {
            const auto start =
                static_cast<uint8_t>(browser->current_page * browser->entries_per_page);
            if (!send_browse_request(browser, start, true))
                fail_browse(browser);
        }
    }

    bool full = browser_ui_update_pending(browser);
    bool selection_only = browser_selection_update_pending(browser);
    if (!full && !selection_only) {
        return;  // No update needed
    }

    if (full) {
        ESP_LOGD(TAG,
                 "Processing pending UI update for file browser with %d entries",
                 browser->entry_count);
        // A rebuild ends with update_visual_selection, so it satisfies any
        // concurrent highlight request too.
        browser_clear_ui_update(browser);
        browser_clear_selection_update(browser);

        // Update UI (caller must hold LVGL lock - this is called from UI task loop)
        update_file_browser_ui(browser);
    } else {
        // Selection moved within the current viewport: restyle the existing
        // buttons instead of destroying and recreating them.
        browser_clear_selection_update(browser);
        update_visual_selection(browser);
    }

    ESP_LOGD(TAG, "UI update complete");
}

// NOTE: Must be called with LVGL lock already held (from UI task loop)
static void update_file_browser_ui(wavex_file_browser_t* browser) {
    if (!browser || !browser->list)
        return;

    if (browser->path_label) {
        lv_label_set_text(browser->path_label, browser->current_path);
    }

    // Clearing the list destroys the spinner row along with everything else,
    // so drop our handle to it. Leaving it dangling made fb_show_loading_row()
    // delete whatever LVGL later allocated at the same address - the pointer
    // compares "valid" again once the allocator reuses it.
    lv_obj_clean(browser->list);
    browser->loading_row = nullptr;

    if (browser->entry_count > 0 && browser->entries) {
        if (browser->first_visible_index >= browser->entry_count) {
            browser->first_visible_index = 0;
        }

        uint32_t start_index = browser->first_visible_index;
        uint32_t end_index = start_index + browser->visible_count;
        if (end_index > browser->entry_count) {
            end_index = browser->entry_count;
        }

        for (uint32_t i = start_index; i < end_index; i++) {
            if (!browser->entries[i].name[0]) {
                ESP_LOGW(TAG, "Skipping empty entry at index %d", i);
                continue;
            }

