pmorgantech/WaveX/firmware/esp32/components/ui/components/file_browser.cpp
            lv_obj_t* btn = lv_list_add_btn(browser->list, NULL, browser->entries[i].name);
            if (!btn) {
                ESP_LOGE(TAG, "Failed to create button for entry %d", i);
                continue;
            }

            ui_theme_apply_button_style(btn, true);
            fb_style_row(btn, &browser->entries[i], i == browser->selected_index);

            if (browser->entries[i].is_directory) {
                lv_obj_t* label = lv_obj_get_child(btn, 0);
                if (label) {
                    char dir_text[64];
                    snprintf(dir_text, sizeof(dir_text), "[DIR] %s", browser->entries[i].name);
                    lv_label_set_text(label, dir_text);
                }
            }

            // Entry index stored on the button; update_visual_selection() and
            // file_list_event_cb() read it back to map a row to its data.
            lv_obj_set_user_data(btn, (void*)(uintptr_t)i);
            // SHORT_CLICKED on the row, not CLICKED on the list.
            //
            // The list is scrollable, and LVGL suppresses LV_EVENT_CLICKED when
            // a press on a scrollable object is taken as the start of a scroll
            // gesture - which on a touch panel is most taps, because a finger
            // rarely lands and lifts without moving. The row still showed its
            // pressed style, so the tap looked registered while the selection
            // never moved. SHORT_CLICKED fires on a quick press-release and is
            // what UIMenuPage's items already use.
            lv_obj_add_event_cb(btn, file_list_event_cb, LV_EVENT_SHORT_CLICKED, browser);
        }

        update_visual_selection(browser);

        ESP_LOGD(TAG, "Updated file browser UI with %d entries", browser->entry_count);
    } else if (browser->entry_count == 0 && !browser_pagination_in_progress(browser)) {
        // Pagination finished and the directory is genuinely empty.
        lv_obj_t* btn = lv_list_add_btn(
            browser->list,
            NULL,
            browser->browse_failed ? "Browse failed - tap to retry" : "No files found...");
        if (browser->browse_failed) {
            lv_obj_add_event_cb(
                btn,
                [](lv_event_t* event) {
                    wavex_file_browser_refresh(
                        static_cast<wavex_file_browser_t*>(lv_event_get_user_data(event)));
                },
                LV_EVENT_SHORT_CLICKED,
                browser);
        }
        lv_obj_set_user_data(btn, (void*)(uintptr_t)FB_ROW_NOT_AN_ENTRY);
        ui_theme_apply_button_style(btn, false);
        lv_obj_set_style_text_color(btn, UI_COLOR_TEXT, LV_PART_MAIN);
        lv_obj_set_style_text_font(btn, UI_FONT_SMALL, LV_PART_MAIN);
        ESP_LOGI(TAG, "No files found in directory");
    } else {
        // entry_count is 0 and pagination is still in flight (entries is
        // always allocated once the browser exists, so the branches above
        // cover every other case): the first page of a fresh navigation
        // hasn't arrived yet. This used to show "Error loading files",
        // which flashed a false alarm on every directory change. Show the
        // loading spinner instead; the rebuild that comes with the first
        // page replaces it.
        fb_show_loading_row(browser, true);
    }

    wavex_ui_mark_content_changed();
}

// NOTE: Must be called with LVGL lock already held. child_count only covers
// the currently-visible rows, since off-screen entries have no LVGL object.
static void update_visual_selection(wavex_file_browser_t* browser) {
    if (!browser || !browser->list)
        return;

    uint32_t child_count = lv_obj_get_child_cnt(browser->list);

    if (browser->selected_index >= browser->entry_count) {
        browser->selected_index = 0;
    }

    for (uint32_t i = 0; i < child_count; i++) {
        lv_obj_t* btn = lv_obj_get_child(browser->list, i);
        if (btn) {
            uint32_t entry_index = (uint32_t)(uintptr_t)lv_obj_get_user_data(btn);

            const wavex_file_entry_t* entry =
                (entry_index < browser->entry_count) ? &browser->entries[entry_index] : nullptr;
            fb_style_row(btn, entry, entry_index == browser->selected_index);
        }
    }
    wavex_ui_mark_content_changed();
}

// RX copies storage state; the UI applies it after releasing the queue lock.
static void storage_status_callback(bool mounted, void* user_data) {
    auto* browser = static_cast<wavex_file_browser_t*>(user_data);
    if (browser)
        browser->inbox->storage.Push(mounted);
    wavex_ui_mark_content_changed();
}

static void apply_storage_status(bool mounted, void* user_data) {
    wavex_file_browser_t* browser = (wavex_file_browser_t*)user_data;
    if (!browser) {
        return;
    }
    browser->storage_mounted = mounted;
    if (!mounted) {
        browser->inbox->replies.Clear();
        browser->browse_failed = false;
        browser->request_id = 0;
        browser->selected_index = browser->first_visible_index = 0;
        browser->entry_count = browser->loaded_entries = 0;
        browser_set_ui_update(browser);
        browser_clear_pagination_in_progress(browser);
        ESP_LOGI(TAG, "Storage lost - browser idle");
        return;
    }
    ESP_LOGI(TAG, "Storage available - re-listing '%s'", browser->current_path);
    refresh_file_list(browser);
}

bool wavex_file_browser_loading(wavex_file_browser_t* browser) {
    return browser && browser_pagination_in_progress(browser);
}
bool wavex_file_browser_set_filter(wavex_file_browser_t* browser, BrowseFilter filter) {
    if (!browser || !BrowseFilterValid(filter) || browser_pagination_in_progress(browser))
        return false;
    const auto previous = browser->config.filter;
    browser->config.filter = filter;
    if (wavex_file_browser_refresh(browser))
        return true;
    browser->config.filter = previous;
    return false;
}
